In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('./datasets/sales/sales/sales.csv',index_col='month')

In [3]:
df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [4]:
print(df['salt']['Feb'])
print(df.eggs['Mar'])
#better to use accessors (.loc and .iloc) notice loc is inclusive but iloc is not inclusive at the end
print(df.loc['Mar','eggs'])
print(df.loc['Mar':'Jun',['eggs','spam']])
print(df.loc[:,'eggs':'salt'])
print(df.iloc[0,0]) #note the 0,0 starts with first row and first column
print(df.iloc[[0,4,5],0:2])

50.0
221
221
       eggs  spam
month
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55
       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0
47
       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

In [5]:
#subset a dataframe into a new dataframe
df_new=df[['salt','eggs']]
print(df_new)
df_e=df[['eggs']]
print(df_e)
print(type(df_e))

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205
       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205
<class 'pandas.core.frame.DataFrame'>

In [6]:
#selecting a column forms a series
e=df['eggs']
print(e)
print(type(e))
print(e[1:4])
print(e[4])

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64
<class 'pandas.core.series.Series'>
month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64
132

In [14]:
#filtering
#creating a boolean series
es= df['salt']>60
print(es)
print(type(es))
egs=df['eggs'][df['salt']>65]
print(egs)
print(type(egs))
dfes=df[es]
print(dfes)
print(type(dfes))
eg2=df[['eggs','spam']][es]
print(eg2)
print(type(eg2))

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool
<class 'pandas.core.series.Series'>
month
Mar    221
Apr     77
Name: eggs, dtype: int64
<class 'pandas.core.series.Series'>
       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20
<class 'pandas.core.frame.DataFrame'>
       eggs  spam
month
Mar     221    72
Apr      77    20
<class 'pandas.core.frame.DataFrame'>

In [32]:
#Combining filters & and or
print(df[(df['salt']>=50)&(df['eggs']<200)])
print((df[(df['salt']>=50)|(df['eggs']<200)]))

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20
       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [55]:
df2=df.copy()
df2['bacon']=[0,0,50,60,70,80]

In [35]:
df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [51]:
#locate zeros and NaNs
print(df2.all())#which columns have all non-zero values
print(df2.any())#which columns have any non-zero entries
print(df2.loc[:,df2.all()])
print(df2.isnull().any())#which rows or columns contain NaNs
print(df2.loc[:,df2.isnull().any()]) #columns where some data in NaN
print(df2.loc[:,df2.notnull().all()])#all columns where all data is present

eggs      True
salt      True
spam      True
bacon    False
dtype: bool
eggs     True
salt     True
spam     True
bacon    True
dtype: bool
       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55
eggs     False
salt      True
spam     False
bacon    False
dtype: bool
       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0
       eggs  spam  bacon
month
Jan      47    17      0
Feb     110    31      0
Mar     221    72     50
Apr      77    20     60
May     132    52     70
Jun     205    55     80

In [56]:
#dropping rows with NaNs
df2.dropna(how='any',inplace=True)
df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [68]:
#transforming dataframes
df['eggs dozens']=df['eggs'].floordiv(12)
df['spam & eggs']=df['eggs dozens']+df['spam']
df
#np.floor_divide(df['eggs'],12) #same thing; good for performing the calculation over the entire vector without any loops

       eggs  salt  spam  eggs dozens  spam & eggs
month
jan      47  12.0    17            3           20
feb     110  50.0    31            9           40
mar     221  89.0    72           18           90
apr      77  87.0    20            6           26
may     132   NaN    52           11           63
jun     205  60.0    55           17           72

In [67]:
#df index
print(df.index)
df.index=df.index.str.upper()
print(df.index)
df.index = df.index.map(str.lower) #index has map method instead of apply method
print(df.index)
#set a column as index
df.index() = df['Zip'] 
del df['Zip']

stocks=stocks.set_index(['Symbol','Date']) #multi-index
stocks=stocks.sort_index()

Index(['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN'], dtype='object', name='month')
Index(['JAN', 'FEB', 'MAR', 'APR', 'MAY', 'JUN'], dtype='object', name='month')
Index(['jan', 'feb', 'mar', 'apr', 'may', 'jun'], dtype='object', name='month')

In [ ]:
too_close = election['margin']<1

# Assign np.nan to the 'winner' column where the results were too close to call
election['winner'][too_close]= np.nan

def to_celsius(F):
    return 5/9*(F - 32)

# Apply the function over 'Mean TemperatureF' and 'Mean Dew PointF': df_celsius
df_celsius = weather[['Mean TemperatureF','Mean Dew PointF']].apply(to_celsius)

# Create the dictionary: red_vs_blue
red_vs_blue = {'Obama':'blue','Romney':'red'}

# Use the dictionary to map the 'winner' column to the new column: election['color']
election['color'] = election['winner'].map(red_vs_blue)

from scipy.stats import zscore

# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election['turnout'])

df.index() = df['Zip'] 
del df['Zip']

stocks=stocks.set_index(['Symbol','Date'])
stocks=stocks.sort_index()

#pivot for re-arranging columns in the data frame
visitors_pivot = users.pivot(index='weekday',columns='city',values='visitors') #pivot requires unique
more_trials.pivot_table(index='treatment',columns='gender',values='response',aggfunc='count')#pivot tables can handle non unqiue

#or unstacking a multi-index
trials.unstack(level='gender') #this results in hierarchial columns
trial.stack(level='gender') #working with hierarchial columns
df=stached.swap_levels

#melt
pd.melt(new_trials,id_vars=['treatment'],var_name='gender',value_name='response')

In [15]:
#Group by
sales=pd.DataFrame({'weekday':['Sun','Sun','Mon','Mon'],'city':['Austin','Dallas','Austin','Dallas'],'bread':[139,237,326,456],'butter':[20,45,70,98]})
print(sales)
print(sales.groupby('weekday')['bread','butter'].sum())
print(sales.groupby(['city','weekday']).mean())

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98
         bread  butter
weekday
Mon        782     168
Sun        376      65
                bread  butter
city   weekday
Austin Mon        326      70
       Sun        139      20
Dallas Mon        456      98
       Sun        237      45

In [78]:
sales['weekday'].unique()
sales['weekday']=sales['weekday'].astype('category')
sales['weekday']

0    Sun
1    Sun
2    Mon
3    Mon
Name: weekday, dtype: category
Categories (2, object): [Mon, Sun]

In [36]:
cityg=sales.groupby('city')
print((cityg['weekday','bread','butter']).apply('values').nuniques())

TypeError: 'str' object is not callable

In [122]:
print(sales)
print(sales.groupby('city')[['bread','butter']].agg(['max','sum']))
def data_range(series):
    return series.max()-series.min()
print(sales.groupby('weekday')[['bread','butter']].agg({'range sold':data_range}))

  weekday    city  bread  butter
0     Sun  Austin    139      20
1     Sun  Dallas    237      45
2     Mon  Austin    326      70
3     Mon  Dallas    456      98
       bread      butter
         max  sum    max  sum
city
Austin   326  465     70   90
Dallas   456  693     98  143
        range sold
             bread butter
weekday
Mon            130     28
Sun             98     25

C:\ProgramData\Anaconda3\lib\site-packages\pandas\core\groupby\groupby.py:4656: FutureWarning: using a dict with renaming is deprecated and will be removed in a future version
  return super(DataFrameGroupBy, self).aggregate(arg, *args, **kwargs)

In [79]:
titanic=pd.read_csv('./datasets/titanic.csv')

In [80]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [126]:
by_class = titanic.groupby('pclass')
by_mult = titanic.groupby(['embarked','pclass'])
count_by_class=by_class['name'].count()
print(count_by_class)
count_mult=by_mult['name'].count()
print(count_mult)
survived_by_class=by_class['survived'].sum()
print(survived_by_class)
per_survived_by_class=survived_by_class/count_by_class*100
print(per_survived_by_class)
maxmed_by_class=by_class['age','fare'].agg(['max','median']) #note how we use agg to reduce down
print(maxmed_by_class)
print(maxmed_by_class.loc[:,('age','max')])

pclass
1    323
2    277
3    709
Name: name, dtype: int64
embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: name, dtype: int64
pclass
1    200
2    119
3    181
Name: survived, dtype: int64
pclass
1    61.919505
2    42.960289
3    25.528914
dtype: float64
         age             fare
         max median       max   median
pclass
1       80.0   39.0  512.3292  60.0000
2       70.0   29.0   73.5000  15.0458
3       74.0   24.0   69.5500   8.0500
pclass
1    80.0
2    70.0
3    74.0
Name: (age, max), dtype: float64

In [148]:
def c_deck_survival(gr):
    c_passengers = gr['cabin'].str.startswith('C').fillna(False)
    return gr.loc[c_passengers, 'survived'].mean()
# Create a groupby object using titanic over the 'sex' column: by_sex
by_sex = titanic.groupby('sex')

# Call by_sex.apply with the function c_deck_survival
c_surv_by_sex = by_sex.apply(c_deck_survival)

# Print the survival rates
print(c_surv_by_sex)

sex
female    0.913043
male      0.312500
dtype: float64

In [149]:
# Create the Boolean Series: under10
under10 = (titanic['age']<10).map({True:'under 10',False:'over 10'})

# Group by under10 and compute the survival rate
survived_mean_1 = titanic.groupby(under10)['survived'].mean()
print(survived_mean_1)

# Group by under10 and pclass and compute the survival rate
survived_mean_2 = titanic.groupby([under10,'pclass'])['survived'].mean()
print(survived_mean_2)

age
over 10     0.366748
under 10    0.609756
Name: survived, dtype: float64
age       pclass
over 10   1         0.617555
          2         0.380392
          3         0.238897
under 10  1         0.750000
          2         1.000000
          3         0.446429
Name: survived, dtype: float64

In [106]:
life=pd.read_csv('./datasets/gapminder_tidy.csv',index_col='Country')

In [107]:
life.head()

,Year,fertility,life,population,child_mortality,gdp,region
Country,,,,,,,
Afghanistan,1964,7.671,33.639,10474903.0,339.7,1182.0,South Asia
Afghanistan,1965,7.671,34.152,10697983.0,334.1,1182.0,South Asia
Afghanistan,1966,7.671,34.662,10927724.0,328.7,1168.0,South Asia
Afghanistan,1967,7.671,35.170,11163656.0,323.3,1173.0,South Asia
Afghanistan,1968,7.671,35.674,11411022.0,318.1,1187.0,South Asia

In [112]:
lifegr=life[life['Year']==2010].groupby('region')
lifegr['life'].mean()

region
America                       74.037350
East Asia & Pacific           73.405750
Europe & Central Asia         75.656387
Middle East & North Africa    72.805333
South Asia                    68.189750
Sub-Saharan Africa            57.575080
Name: life, dtype: float64

In [132]:
auto=pd.read_csv('./datasets/auto-mpg.csv')
def zscore(series):
    return(series-series.mean())/series.std()
auto.groupby('yr')['mpg'].transform(zscore).head() #note how we use transform for appling a function element-wise to groups

0    0.058125
1   -0.503753
2    0.058125
3   -0.316460
4   -0.129168
Name: mpg, dtype: float64

In [134]:
# use apply when transform or agg wouldn't match
def zscore_with_year_and_name(group):
    df = pd.DataFrame({'mpg': zscore(group['mpg']),'year':group['yr'],'name':group['name']})
    return df
auto.groupby('yr').apply(zscore_with_year_and_name).head()

        mpg  year                       name
0  0.058125    70  chevrolet chevelle malibu
1 -0.503753    70          buick skylark 320
2  0.058125    70         plymouth satellite
3 -0.316460    70              amc rebel sst
4 -0.129168    70                ford torino

In [150]:
auto.groupby('yr')['mpg'].mean()
#what if we only wanted this for Chevy cars
splittering=auto.groupby('yr')
type(splittering)
type(splittering.groups)
print(splittering.groups.keys())
chevy_means={year:group.loc[group['name'].str.contains('chevrolet'),'mpg'].mean() for year,group in splittering}
print(chevy_means)
chevy=auto['name'].str.contains('chevrolet')
auto.groupby(['yr',chevy])['mpg'].mean()

dict_keys([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82])
{70: 15.666666666666666, 71: 20.25, 72: 15.333333333333334, 73: 14.833333333333334, 74: 18.666666666666668, 75: 17.666666666666668, 76: 23.25, 77: 20.25, 78: 23.233333333333334, 79: 21.666666666666668, 80: 30.05, 81: 23.5, 82: 29.0}

yr  name
70  False    17.923077
    True     15.666667
71  False    21.260870
    True     20.250000
72  False    19.120000
    True     15.333333
73  False    17.500000
    True     14.833333
74  False    23.304348
    True     18.666667
75  False    20.555556
    True     17.666667
76  False    21.350000
    True     23.250000
77  False    23.895833
    True     20.250000
78  False    24.136364
    True     23.233333
79  False    25.488462
    True     21.666667
80  False    34.104000
    True     30.050000
81  False    30.433333
    True     23.500000
82  False    32.461538
    True     29.000000
Name: mpg, dtype: float64

In [ ]:
#group by another dataframe with the same index
life = pd.read_csv(life_fname, index_col='Country')
regions = pd.read_csv(regions_fname,index_col='Country')

In [159]:
medals=pd.read_csv('./datasets/all_medalists.csv')
medals.head()
print(medals.describe(include='all'))
medals[medals['NOC']=='USA'].groupby('Edition')['Medal'].count().head()

          City       Edition     Sport Discipline           Athlete    NOC  \
count    29216  29216.000000     29216      29216             29216  29216
unique      22           NaN        42         56             21413    138
top     Athens           NaN  Aquatics  Athletics  LATYNINA, Larisa    USA
freq      2149           NaN      3828       3448                18   4335
mean       NaN   1967.713171       NaN        NaN               NaN    NaN
std        NaN     32.406293       NaN        NaN               NaN    NaN
min        NaN   1896.000000       NaN        NaN               NaN    NaN
25%        NaN   1948.000000       NaN        NaN               NaN    NaN
50%        NaN   1976.000000       NaN        NaN               NaN    NaN
75%        NaN   1996.000000       NaN        NaN               NaN    NaN
max        NaN   2008.000000       NaN        NaN               NaN    NaN

       Gender     Event Event_gender  Medal
count   29216     29216        29216  29216
unique      2       577            3      3
top       Men  football            M   Gold
freq    21721      1387        20067   9850
mean      NaN       NaN          NaN    NaN
std       NaN       NaN          NaN    NaN
min       NaN       NaN          NaN    NaN
25%       NaN       NaN          NaN    NaN
50%       NaN       NaN          NaN    NaN
75%       NaN       NaN          NaN    NaN
max       NaN       NaN          NaN    NaN

Edition
1896     20
1900     55
1904    394
1908     63
1912    101
Name: Medal, dtype: int64

In [170]:
medals.groupby('NOC')['Medal'].count().sort_values(ascending=False)[0:15]
medals['NOC'].value_counts()[0:15]

USA    4335
URS    2049
GBR    1594
FRA    1314
ITA    1228
GER    1211
AUS    1075
HUN    1053
SWE    1021
GDR     825
NED     782
JPN     704
CHN     679
RUS     638
ROU     624
Name: NOC, dtype: int64

In [ ]:
# Import zscore
from scipy.stats import zscore

# Group gapminder_2010: standardized
standardized = gapminder_2010.groupby('region')['life','fertility'].transform(zscore)

# Construct a Boolean Series to identify outliers: outliers
outliers = (standardized['life'] < -3) | (standardized['fertility'] > 3)

# Filter gapminder_2010 by the outliers: gm_outliers
gm_outliers = gapminder_2010.loc[outliers]

# Print gm_outliers
print(gm_outliers)